export interface TimelineEvent {
  id: string;
  year: string;
  month?: string;
  content: string[];
  important?: boolean;
}

export const timelineData: TimelineEvent[] = [
  {
    id: "1",
    year: "长平十五年",
    month: "十二月",
    content: ["白炎生于东齐，", "亡父，有母为犯妇。", "墨离生。"],
  },
  {
    id: "2",
    year: "长平十六年",
    month: "五月",
    content: ["天下大旱，饿殍遍野。"],
  },
  {
    id: "3",
    year: "长平十六年",
    month: "六月",
    content: ["卫明帝祭天。"],
  },
  {
    id: "4",
    year: "长平十六年",
    month: "八月",
    content: [
      "南疆人巫晟携师妹巫婴布衣自荐于朝，",
      "夜起九龙塔于帝宫，引青龙布雨，润泽天下。",
      "明帝以其有大神通，封国师。",
      "是夜，明帝容穆第四子熙降生。",
    ],
    important: true,
  },
  {
    id: "5",
    year: "长平十六年",
    month: "九月",
    content: ["明帝立太子熙，赦天下。", "大赦之日，白炎母吴氏出狱。"],
  },
  {
    id: "6",
    year: "长平十六年",
    month: "十二月",
    content: ["吴氏病卒。"],
  },
  {
    id: "7",
    year: "长平三十六年",
    month: "六月",
    content: [
      "明帝崩。太子继位，改元崇宁。即卫敬帝。",
      "太子妃萧玉为皇后。太史顾家山告老还乡。",
      "顾长宁、苏静、谢卿入太史院。",
    ],
  },
  {
    id: "8",
    year: "崇宁元年",
    month: "十月",
    content: ["朱砂入宫，封美人。"],
  },
  {
    id: "9",
    year: "崇宁二年",
    month: "三月",
    content: ["朱砂封昭仪。"],
  },
  {
    id: "10",
    year: "崇宁二年",
    month: "九月",
    content: ["朱砂有孕，封昭妃。"],
  },
  {
    id: "11",
    year: "崇宁二年",
    month: "十二月",
    content: ["小产。敬帝以谋害皇裔之罪废后。", "是夜，后自缢于冷宫。"],
    important: true,
  },
  {
    id: "12",
    year: "崇宁三年",
    month: "元月",
    content: ["朱砂封贵妃。"],
  },
  {
    id: "13",
    year: "崇宁四年",
    month: "五月",
    content: ["天阑太守谢怀瑾长女婉以殿前武试第一请任天阑守将。"],
  },
  {
    id: "14",
    year: "崇宁四年",
    month: "七月",
    content: [
      "左相慕文远次子清和初识白炎。",
      "朱砂自晋贵妃之位，恩宠无双，权势一时无两。",
      "有朝臣弹劾者，多去官罪死。",
      "敬帝沉湎声色，不理政事。朝堂怨声日甚。",
      "民间多称奸妃。",
    ],
  },
  {
    id: "15",
    year: "崇宁七年",
    month: "四月",
    content: ["慕清和再遇白炎，述己志。"],
  },
  {
    id: "16",
    year: "崇宁七年",
    month: "六月",
    content: [
      "北岭以重赋民变，白炎借势起兵。",
      "慕清和留书离家，投白炎麾下。父兄与之绝。",
    ],
  },
  {
    id: "17",
    year: "崇宁七年",
    month: "七月",
    content: [
      "白炎以慕清和为将，兵发北岭，",
      "攻北方第一城天阑，是为崇宁之乱。",
      "天阑守将谢婉苦战无援，不降而死，",
      "为炎军副将褚七礼枭首三日。",
      "天阑谢氏一门十三口殉城。",
    ],
    important: true,
  },
  {
    id: "18",
    year: "崇宁七年",
    month: "九月",
    content: ["炎军攻城掠地，日近帝都。敬帝时不早朝。"],
  },
  {
    id: "19",
    year: "崇宁七年",
    month: "十一月",
    content: [
      "右相褚九龄府中搜出与弟褚七礼往来信件。",
      "褚九龄被指通敌。褚氏满门抄斩。",
    ],
  },
  {
    id: "20",
    year: "崇宁八年",
    month: "元月",
    content: [
      "炎军临帝都天岁。",
      "国师巫晟以一人之力阻其于帝都外三日，其后不知所踪。",
      "天岁城陷。贵妃朱砂堕城殉国。",
      "白炎鸩敬帝容熙。",
    ],
    important: true,
  },
  {
    id: "21",
    year: "崇宁八年",
    month: "二月",
    content: [
      "白炎即位，定国号周，改元永初。即周元帝。",
      "城陷之日，苏静不知所踪，谢卿自焚于室，顾长宁降。",
      "墨离隐，人以为殁。",
    ],
  },
  {
    id: "22",
    year: "永初元年",
    month: "四月",
    content: [
      "慕清和以将印换取慕氏平安百年之帝王承诺，远走海外。",
      "顾氏一门返京，顾长宁复职修史。",
    ],
  },
  {
    id: "23",
    year: "永初元年",
    month: "五月",
    content: ["礼官议卫帝谥号曰荒，元帝异之，曰敬。"],
  },
  {
    id: "24",
    year: "永初十年",
    month: "十一月",
    content: ["墨离入宫献上前朝贵妃画像一幅后离去。"],
  },
  {
    id: "25",
    year: "永初十年",
    month: "十二月",
    content: ["元帝崩。诸王作乱。史称永初之乱。"],
  },
  {
    id: "26",
    year: "永初十一年",
    month: "九月",
    content: ["秦王白彻起兵平叛。"],
  },
  {
    id: "27",
    year: "永初十一年",
    month: "十二月",
    content: ["胜六王联军于天阑之野。"],
  },
  {
    id: "28",
    year: "永初十二年",
    month: "元月",
    content: ["秦王白彻登基，改元太业。即周武帝。"],
  },
  {
    id: "29",
    year: "永初十二年",
    month: "二月",
    content: ["武帝与摇光皇后楚落大婚，赦天下。", "遂祭宗庙，尊白炎为元皇帝。"],
  },
];
